Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/government_in_ireland/european_government/eu_law/charter_of_fundamental_rights.html.txt.tmx
Source language: en
Languages: ga

source: Charter of Fundamental Rights
ga: An Chairt um Chearta Bunúsacha

source: The EU Charter of Fundamental Rights lists the civil, political, social and economic rights which are recognised by the European Union (EU)
ga: Tugtar liosta de na cearta sibhialta, polaitiúla, sóisialta agus geilleagracha ar Chairt an Aontais Eorpaigh um Chearta Bunúsacha a aithníonn an tAontas Eorpach (AE)

source: These are listed under the headings of Dignity, Freedoms, Equality, Solidarity, Citizens’ Rights, and Justice and there are specific principles which apply to specific groups such as older people, children and people with disabilities
ga: Tá liosta díobh seo faoi na teidil a leanas: Dínit, Saoirse, Comhionannas, Dlúthpháirtíocht, Cearta Saoránach, agus Ceartas agus tá prionsabail shonracha ann a bhaineann le grúpaí sonracha, ar nós daoine scothaosta, leanaí agus daoine atá faoi mhíchumas

source: These rights are derived from a number of sources including existing EU law, the Social Charters of the EU and the Council of Europe, the European Convention on Human Rights and the constitutional traditions of the member states
ga: Eascraíonn na cearta seo ó roinnt foinsí, lena n-áirítear dlí reatha an AE, Cairteacha Sóisialta an AE agus Comhairle na hEorpa, an Coinbhinsiún Eorpach um Chearta an Duine agus traidisiúin bhunreachtúla na mballstát

source: All the member states have ratified the European Convention on Human Rights
ga: Dhaingnigh gach ballstát an Coinbhinsiún Eorpach um Chearta an Duine

source: The Treaty of Lisbon allows for the EU itself to accede to that Convention
ga: Ceadaíonn Conradh Liospóin don AE, é féin, aontú don Choinbhinsiún sin

source: The Treaty of Lisbon gives the Charter the same legal value as the main treaties
ga: Bronnann Conradh Liospóin an fiúntas céanna dlíthiúil ar an gCairt a bhronntar ar na príomhchonarthaí

source: The Charter applies to the EU institutions and to the member states when they are implementing EU law
ga: Baineann an Chairt le hinstitiúidí an AE agus leis na ballstáit nuair a bhíonn dlí an AE á chur i bhfeidhm acu

source: The Charter does not extend the application of EU law or give the EU any new area of competence
ga: Ní sháraíonn an Chairt cur i bhfeidhm dhlí an AE agus ní bhronnann sé aon limistéar nua inniúlachta ar an AE

source: The main rights set out in the Charter are as follows:
ga: Is iad seo a leanas na príomhchearta a leagtar amach sa Chairt:

source: This heading covers human dignity, the right to life, the right to integrity of the person, the prohibition of torture and inhuman or degrading treatment or punishment, and the prohibition of slavery and forced labour
ga: Cuimsíonn an teideal seo dínit dhaonna, an ceart chun beatha, an ceart chun iomláine an duine, toirmeasc a chur ar chéasadh agus ar chaitheamh mídhaonna nó íde nó pionós, agus toirmeasc a chur ar sclábhaíocht agus ar shaothar éigeantach

source: This heading includes the right to liberty and security; respect for private and family life; the protection of personal data; the right to marry and have a family; freedom of thought, conscience and religion; freedom of expression and information; freedom of assembly and association; freedom of the arts and sciences; the right to education; the freedom to choose an occupation and the right to engage in work; the freedom to conduct a business; the right to property; the right to asylum; and protection in the event of removal, expulsion or extradition
ga: Áirítear leis an teideal seo an ceart chun saoirse agus slándála; meas a léiriú ar an saol príobháideach agus ar shaol an teaghlaigh; sonraí pearsanta a chosaint; an ceart chun pósta agus chun leanaí a thabhairt ar an saol; saoirse smaointeoireachta, coinsiasa agus reiligiúin; saoirse chun nochta agus faisnéise; saoirse chun tionóil agus comhlachais; saoirse na n-ealaíon agus na n-eolaíochtaí; an ceart chun oideachas a fháil; saoirse chun gairm bheatha a roghnú agus an ceart chun oibriú; saoirse chun tabhairt faoi ghnó; an ceart chun réadmhaoine; an ceart chun tearmainn; agus an cearta chun cosanta i gcás bainte, díbeartha nó eiseachadta

source: This heading covers equality before the law; non-discrimination; cultural, religious and linguistic diversity; equality between women and men; the rights of the child; the rights of older people; the integration of people with disabilities
ga: Cuimsíonn an teideal seo comhionannas os comhair an dlí; neamh-idirdhealú; éagsúlacht chultúrtha, reiligiúnach agus theangeolaíoch; comhionannas idir mná agus fir; cearta an linbh; cearta daoine scothaosta; comhtháthú daoine atá faoi mhíchumas

source: This heading covers workers’ right to information and consultation within the undertaking; the right of collective bargaining and action; the right of access to placement services; protection in the event of unjustified dismissal; fair and just working conditions; the prohibition of child labour and the protection of young people at work; family and professional life; social security and social assistance; health care; access to services of general economic interest; environmental protection; and consumer protection
ga: Cuimsíonn an teideal seo ceart oibrithe chun faisnéis a fháil agus chun dul i mbun comhairliúcháin laistigh den ghealltanas; an ceart chun margáil agus gníomhaíocht a dhéanamh; an ceart chun seirbhísí socrúcháin a rochtain; an ceart chun cosanta i gcás dífhostú gan údar; coinníollacha cothroma agus cearta oibre; toirmeasc a chur ar shaothar leanaí agus daoine óga a chosaint ag an obair; saol na gairme agus an teaghlaigh; slándáil shóisialta agus cúnamh sóisialta; cúram sláinte; rochtain ar sheirbhísí lena mbaineann leas ginearálta geilleagrach; cosaint comhshaoil; agus cosaint tomhaltóirí

source: This heading covers the right to vote and to stand as a candidate at elections to the European Parliament; the right to vote and to stand as a candidate at local elections; the right to good administration; the right of access to documents; the European Ombudsman; the right to petition the European Parliament; freedom of movement and of residence; and diplomatic and consular protection
ga: Cuimsíonn an teideal seo an ceart chun vóta a chaitheamh agus chun seasamh a dhéanamh mar iarrthóir sna toghcháin le Parlaimint na hEorpa; an ceart chun vóta a chaitheamh agus chun seasamh a dhéanamh mar iarrthóir sna toghcháin áitiúla; an ceart chun dea-riaracháin; ceart rochtana ar cháipéisí; Ombudsman na hEorpa; an ceart chun achainí a dhéanamh i leith Pharlaimint na hEorpa; saoirse ghluaiseachta agus chónaithe; agus cosaint taidhleoireachta agus consalachta

source: This heading covers the right to an effective remedy and to a fair trial; the presumption of innocence and the right of defence; the principles of the legality and proportionality of criminal offences and penalties; and the right not to be tried or punished twice in criminal proceedings for the same criminal offence
ga: Cuimsíonn an teideal seo na cearta chun réiteach éifeachtach a bhaint amach agus chun triail chóir a fháil; toimhde na neamhchiontachta agus an ceart chun cosanta; prionsabail na dlíthiúlachta agus comhréireacht cionta coiriúla agus pionós; agus an ceart nach ndéantar thú a thriail nó nach ngearrtar pionós ort faoi dhó in imeachtaí coiriúla don chion céanna coiriúil

source: Further information on the Charter is available on the European Commission's website
ga: Tá fáil ar thuilleadh faisnéise ar an gCairt ar a láithreán gréasáin an Choimisiúin Eorpaigh
